## Advanced SQL Puzzles

In [ ]:
import pandas as pd

### Puzzle 1

In [ ]:
d1 = {'item': ['Sugar', 'Bread', 'Juice', 'Soda', 'Flour']}
df1 = pd.DataFrame(data=d1)

In [ ]:
df1['Item Cart 1'] = df1['item']

In [ ]:
df1.set_index('item')

In [ ]:
df1.head()

In [ ]:
d2 = {'item': ['Sugar', 'Bread', 'Butter', 'Cheese', 'Fruit']}
df2 = pd.DataFrame(data=d2)

In [ ]:
df2['Item Cart 2'] = df2['item']

In [ ]:
df2.head()

In [ ]:
df2.set_index('item')

In [ ]:
df3 = df1.merge(df2, how="outer")[['Item Cart 1', 'Item Cart 2']]

In [ ]:
df3

### Task 2

In [4]:
import numpy as np
import pandas as pd

In [85]:
d = {'Employee ID': [1001, 2002, 3003, 4004, 5005, 6006, 7007],
     'Manager ID': [np.nan, 1001, 1001, 2002, 2002, 2002, 5005],
     'Job Title': ['President', 'Director', 'Office Manager', 'Engineer', 'Engineer', 'Engineer', "Intern"]}
df = pd.DataFrame(data=d, dtype=np.int16)

C:\Users\the_r\AppData\Local\Temp/ipykernel_5464/2033519502.py:4: FutureWarning: Could not cast to int16, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(data=d, dtype=np.int16)

In [86]:
df.head()

   Employee ID Manager ID       Job Title
0         1001        NaN       President
1         2002       1001        Director
2         3003       1001  Office Manager
3         4004       2002        Engineer
4         5005       2002        Engineer

In [87]:
df[df["Employee ID"] == 1001]["Manager ID"].values.any()

nan

In [88]:
df[df["Employee ID"] == 2002]["Manager ID"].values.any()

1001

In [110]:
def checkDeep(EmployeeID, c):
    if df[df["Employee ID"] == EmployeeID]["Manager ID"].isnull().values.any():
        return c
    else:
        c = checkDeep(df[df["Employee ID"] == EmployeeID]["Manager ID"].values.any(), c+1)
        return c

In [112]:
df['Depth'] = df['Employee ID'].apply(lambda x: checkDeep(x, c=0))

In [114]:
df.head()

   Employee ID Manager ID       Job Title  Depth
0         1001        NaN       President      0
1         2002       1001        Director      1
2         3003       1001  Office Manager      1
3         4004       2002        Engineer      2
4         5005       2002        Engineer      2

### Task 3

In [116]:
d = {'Customer ID': [1001, 1001, 1001, 1001, 2002, 3003, 3003, 4004],
     'Order ID ': [1, 2, 3, 4, 5, 6, 7, 8],
     'Delivery State': ['CA', 'TX', 'TX', 'TX', 'WA', 'CA', "CA", 'TX'],
     'Amount': ["$340", '$950', '$670', '$860', '$320', '$650', '$830', '$120']}
df = pd.DataFrame(data=d, dtype=np.int16)

C:\Users\the_r\AppData\Local\Temp/ipykernel_5464/1119302731.py:5: FutureWarning: Could not cast to int16, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(data=d, dtype=np.int16)

In [117]:
df.head()

   Customer ID  Order ID  Delivery State Amount
0         1001          1             CA   $340
1         1001          2             TX   $950
2         1001          3             TX   $670
3         1001          4             TX   $860
4         2002          5             WA   $320

In [122]:
df[df['Delivery State'] == 'TX'].head(len(df[df['Delivery State'] == 'CA']))

   Customer ID  Order ID  Delivery State Amount
1         1001          2             TX   $950
2         1001          3             TX   $670
3         1001          4             TX   $860